In [229]:
import pandas as pd

In [230]:
data = pd.read_csv(r"C:\Users\Chaitanya\OneDrive\Desktop\NTIN SIR\traffic.csv", sep='$', header=None)
data.columns = ['name', 'age', 'gender', 'salary', 'state']

In [231]:
data

    name  age  gender   salary   state
0   name  age  gender   salary   state
1  nitin   33       m  5000000   delhi
2  sahil   65       m   899999  mumbai
3   golu   10       m  1000000   delhi
4  bittu   20       m   600000    pune
5    nia   30       f    70000   delhi
6    jia   29       f   200000   delhi
7   piya   26       f      600  mumbai

In [232]:
val={'sales':[30,50,70],'age':[4,7,8]}

In [233]:
pd.DataFrame(val)

   sales  age
0     30    4
1     50    7
2     70    8

In [234]:
pd.DataFrame(val,index=['a','b','c'])

   sales  age
a     30    4
b     50    7
c     70    8

In [235]:
val=[[20,50,70],['nitin','arun','nitesh']]

In [236]:
ind=pd.MultiIndex.from_arrays(val,names=['age','name'])

In [237]:
ind

MultiIndex([(20,  'nitin'),
            (50,   'arun'),
            (70, 'nitesh')],
           names=['age', 'name'])

In [238]:
pd.DataFrame({'sales':[30,40,50]},index=ind)

            sales
age name
20  nitin      30
50  arun       40
70  nitesh     50

In [239]:
data = data.set_index(['name','age'])

In [240]:
data

           gender   salary   state
name  age
name  age  gender   salary   state
nitin 33        m  5000000   delhi
sahil 65        m   899999  mumbai
golu  10        m  1000000   delhi
bittu 20        m   600000    pune
nia   30        f    70000   delhi
jia   29        f   200000   delhi
piya  26        f      600  mumbai

In [241]:
data.loc['nitin']

    gender   salary  state
age
33       m  5000000  delhi

In [245]:
max_age = data.groupby('gender')['age'].max()
print("My Math Worked:")
print(max_age)

KeyError: 'Column not found: age'

In [242]:
data.groupby('gender')['age'].max()

KeyError: 'Column not found: age'

In [243]:
data.loc[2, 'name'] = 'vishal'
data.loc[6, 'name'] = 'rajan'

In [244]:
# Move everything back to columns temporarily for the calculation
data.reset_index().groupby('gender')['age'].max()

ValueError: cannot insert name, already exists

In [78]:
# 1. Move everything back to regular columns
df_clean = data.reset_index()

# 2. Force the 'name' and 'age' columns to be clean (no spaces)
df_clean['name'] = df_clean['name'].astype(str).str.strip()
df_clean['age'] = pd.to_numeric(df_clean['age'], errors='coerce')

# 3. Now search normally without the index headache
result = df_clean[df_clean['name'] == 'jia']
print(result)

ValueError: cannot insert name, already exists

In [79]:
# 1. Reset the index so we aren't fighting the MultiIndex rules
df_temp = data.reset_index()

# 2. Use .astype(str) so we can find Jia even if there are hidden spaces
result = df_temp[df_temp['name'].astype(str).str.contains('jia')]

print(result)

ValueError: cannot insert name, already exists

In [80]:
data

            gender   salary    name
name   age
name   age  gender   salary     NaN
nitin  33        m  5000000     NaN
vishal 65        m   899999     NaN
golu   10        m  1000000     NaN
bittu  20        m   600000     NaN
nia    30        f    70000     NaN
rajan  29        f   200000     NaN
piya   26        f      600     NaN
2              NaN      NaN  vishal
6              NaN      NaN   rajan